#+STARTUP: overview indent num align inlineimages logdone hidestars hideblocks
** 保存時、不要な空白を削除

#+begin_src emacs-lisp
(add-hook 'before-save-hook 'delete-trailing-whitespace)
#+end_src

#+RESULTS:
| delete-trailing-whitespace |

** doctを利用したorg-captureの設定

- [[https://orgmode.org/manual/Capture.html][Capture (The Org Manual)]]
- [[https://orgmode.org/manual/Setting-up-capture.html#Setting-up-capture][Setting up capture (The Org Manual)]]
- [[https://www.5ing-myway.com/org-capture/][org-captureをカスタマイズして、すばやくメモを取る方法 | 趣味に生きる。]]

- ファイルは org-directory 以下にある。

- [[https://github.com/progfolio/doct#installation][GitHub - progfolio/doct: DOCT: Declarative Org Capture Templates for Emacs]]
- ミニバッファで日本語が入力できない
- [[https://blog.tomoya.dev/posts/a-new-wave-has-arrived-at-emacs/][Emacsの次世代ミニバッファ補完UI | 日々、とんは語る。]]

#+begin_src emacs-lisp
  (leaf doct
    :ensure t
    ;;recommended: defer until calling doct
    ;:commands (doct)
    :config
    (setq org-capture-templates
        (doct '(("Memo" :keys "m"
                 :prepend t
                 :empty-lines-after 1
                 :jump-to-captured t
                 :file "~/Dropbox/Org/Memo.org"
                 :datetree t
                 :todo-state "TODO"
                 :template ("* %{todo-state} %^{Description}"
                            ":PROPERTIES:"
                            ":Created: %U"
                            ":END:"
                            "\n%?"))
                ("Blog" :keys "b"
                 :prepend t
                 :empty-lines-after 1
                 :jump-to-captured t
                 :children (
                   ("ychubachi.github.io"  :keys "g"
                             :file "~/Dropbox/Org/ychubachi.github.io.org"
                             :headline   "Blog"
                             :todo-state "TODO"
                             :export_file_name (lambda () (concat (format-time-string "%Y%m%d-%H%M%S")))
                             :template ("* %{todo-state} %^{Description}"
                                        ":PROPERTIES:"
                                        ":Created: %T"
                                        ":EXPORT_FILE_NAME: %{export_file_name}"
                                        ":EXPORT_DATE: %U"
                                        ":END:"
                                        "\n%?"))
                   ("ploversky.net" :keys "p"
                             :file "~/Dropbox/Org/blog/ploversky.net/ploversky.net.org"
                             :todo-state "TODO"
                             :template ("* %{todo-state} %^{Description}"
                                        ":PROPERTIES:"
                                        ":Created: %u"
                                        ":CATEGORY: Blog"
                                        ":POST_TAGS: Blog"
                                        ":BLOG:     plover"
                                        ":END:"
                                        "%?"))
                            ))
                ("Parent" :keys "p"
                 :file "~/example.org"
                 :prepend t
                 :template ("* %{todo-state} %^{Description}"
                            ":PROPERTIES:"
                            ":Created: %U"
                            ":END:"
                            "%?")
                 :children (("First Child"  :keys "1"
                             :headline   "One"
                             :todo-state "TODO"
                             :hook (lambda () (message "\"First Child\" selected.")))
                            ("Second Child" :keys "2"
                             :headline   "Two"
                             :todo-state "NEXT")
                            ("Third Child"  :keys "3"
                             :headline   "Three"
                             :todo-state "MAYBE")))
                )
              )
        )
  )
#+end_src

#+RESULTS:
: doct

#+begin_src emacs-lisp
  (define-key global-map
    (kbd "C-c m")
    (lambda () (interactive) (org-capture nil "m")))
#+end_src

#+RESULTS:
| lambda | nil | (interactive) | (org-capture nil m) |

*** ソースコードの pretty print
- Windowsの場合
  - scoopでpygmentをインストールしておく
  - python インストールして pip install pygments
  - PATHの登録
    - C:\Users\yc\scoop\apps\python\current\Scripts

  #+begin_src emacs-lisp
    (setq org-export-latex-listings t)

    (setq org-latex-listings 'minted)
    (setq org-latex-minted-options
          '(("frame" "lines")
            ("framesep=2mm")
            ("linenos=true")
            ("baselinestretch=1.2")
            ("fontsize=\\footnotesize")
            ("breaklines")
            ))

    (add-to-list 'org-latex-packages-alist "\\usepackage{minted}" t)
  #+end_src

  #+RESULTS:
  | \usepackage{minted} |

** フォントの設定                                                   :NOLEAF:
- Noto Sansの等幅フォントを設定する
- 表示の確認

- [[https://uwabami.github.io/cc-env/Emacs.html][Emacs の設定 | Youhei SASAKI’s official site]] より

#+begin_example
| mmmm |
| llll |
| 日本 |
| 漢字 |
| ああ |
| んん |
| ￥￥ |
| \\\\ |
| 　　   |
|      |

|abcdefghijkl|
|ABCDEFGHIJKL|
|'";:-+=/\~`?|
|∞≤≥∏∑∫|
|×±≒≡⊆⊇|  ← GUI だと一部半角になる
|αβγδεζ|  ← GUI だと半角になる
|ηθικλμ|  ← GUI だと半角になる
|ΑΒΓΔΕΖ|  ← GUI だと半角になる
|ΗΘΙΚΛΜ|  ← GUI だと半角になる
|日本語の美観|
|あいうえおか|
|アイウエオカ|
|ｱｲｳｴｵｶｷｸｹｺｻｼ|

| hoge                 | hogeghoe | age              |
|----------------------+----------+------------------|
| 今日もいい天気ですね | お、     | 等幅になった👍 🍺|
|----------------------+----------+------------------|
#+end_example

#+begin_src emacs-lisp
(set-frame-font "Noto Sans Mono CJK JP-12" nil t)
;; ↓漢字がボールド体にならない
;; (set-frame-font "PlemolJP-12" nil t)
;; (set-frame-font "HackGen-12" nil t)
#+end_src

#+RESULTS:

#+begin_src emacs-lisp
(setq-default line-spacing 0) ; 行間
#+end_src

#+RESULTS:
: 0

** Wanderlust - Mailクライアント
+ 参考
  - [[https://wanderlust.github.io/wl-docs/wl-ja.html#Install][Wanderlust – Yet Another Message Interface On Emacsen –]]
  - [[https://www.emacswiki.org/emacs/WanderLust][[Home] Wander Lust]]

+ You have to specify the value of 'wl-icon-directory'

+ 問題点：起動して最初にM-x wlをすると、localhostにimap接続に行く
  - .folderに設定がある
  - もともとのデフォルト（一回目に使われる）はこれっぽい
    [[http://quruli.ivory.ne.jp/document/wl_2.14.0/wl-ja_2.html][Wanderlust – Yet Another Message Interface On Emacsen –: 3. Wanderlust で扱えるフォルダたち]]
  - 2回目は.folderから設定を読むようだ

+ el-getではなくpackageでインストールしたほうが挙動がよい
+ 設定等が複雑で、古臭い・・・

#+begin_example
ユーザ名  -> 変数 elmo-imap4-default-user の値。
             初期設定は 環境変数 USER か、LOGNAME か、
             (user-login-name) の返り値。
認証法    -> 変数 elmo-imap4-default-authenticate-type の値。
             初期設定は login。
ホスト名  -> 変数 elmo-imap4-default-server の値。
             初期設定は ‘localhost’。
ポート番号-> 変数 elmo-imap4-default-port の値。
             初期設定は 143。
#+end_example

#+begin_src emacs-lisp
  (leaf wanderlust
    :package t
    :config
    ;; For non ascii-characters in folder-names
    (setq elmo-imap4-use-modified-utf7 t)

    ;; SMTP
    (setq
     wl-smtp-connection-type   'starttls         ; Use TLS
     wl-smtp-posting-port      587               ; The SMTP port
     wl-smtp-authenticate-type "plain"           ; Authentication type
     wl-smtp-posting-user      "yoshihide.chubachi"          ; Username
     wl-smtp-posting-server    "smtp.gmail.com"  ; SMTP server
     wl-local-domain           "gmail.com"       ; The SMTP server again
     wl-message-id-domain      "smtp.gmail.com") ; And... Again?

    (setq
     ;; All system folders (draft, trash, spam, etc) are placed in the
     ;; [Gmail]-folder, except inbox. "%" means it's an IMAP-folder
     wl-default-folder "%inbox"
     wl-draft-folder   "%[Gmail]/Drafts"
     wl-trash-folder   "%[Gmail]/Trash"

     ;; The below is not necessary when you send mail through Gmail's SMTP server,
     ;; see https://support.google.com/mail/answer/78892?hl=en&rd=1
     ;; wl-fcc            "%[Gmail]/Sent"

     wl-from "Yoshihide Chubachi <yoshihide.chubachi@gmail.com>"  ; Our From: header field
     wl-fcc-force-as-read t           ; Mark sent mail (in the wl-fcc folder) as read
     wl-default-spec "%")             ; For auto-completion

    (require 'mime-w3m)
    )
     #+end_src

#+RESULTS:
: wanderlust

#+begin_src emacs-lisp
  (autoload 'wl-user-agent-compose "wl-draft" nil t)
  (if (boundp 'mail-user-agent)
      (setq mail-user-agent 'wl-user-agent))
  (if (fboundp 'define-mail-user-agent)
      (define-mail-user-agent
        'wl-user-agent
        'wl-user-agent-compose
        'wl-draft-send
        'wl-draft-kill
        'mail-send-hook))
#+end_src

#+RESULTS:
: mail-send-hook

- 表示するヘッダを設定

#+begin_src emacs-lisp
  (setq wl-message-ignored-field-list '("^.*:")) ; 一旦全て非表示
  (setq wl-message-visible-field-list ; 見たいヘッダだけ表示
        '("^Subject:"
          "^From:"
          "^To:"
          "^Cc:"
          "^Date:"
          "^Message-ID:"
          ))
#+end_src

#+RESULTS:
| ^Subject: | ^From: | ^To: | ^Cc: | ^Date: | ^Message-ID: |

ｑ- 大きなメールを取得する際、確認しない
  - [[http://quruli.ivory.ne.jp/document/wl_2.14.0/wl-ja_4.html][Wanderlust – Yet Another Message Interface On Emacsen –: 5. サマリモード]]

#+begin_src emacs-lisp
  (setq elmo-message-fetch-confirm nil)
#+end_src

#+RESULTS:
